[
    {
        "WeekID" : "1",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 1</h2><div class='content'><h3 class='dateWeek'>14-09-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>El profesor leyó y explicó el curso y el cronocraga de este, además explicó a detalle las asignaciones</p><p><strong>¿Qué aprendí?</strong></p><p>Aprendí un poco sobre la forma en la que trabaja el profesor y como será la evaluación y funcionalidad del curso</p></div></div></section>"
    },
    {
        "WeekID" : "2",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 2</h2><div class='content'><h3 class='dateWeek'>21-09-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>El profesor hablo y expuso un poco sobre los pueblos indigenas de nuestro país. Además explicó desde eltemade la conquista de America hasta la actualidad como parte del contexto para luego entender temas sobrenuestros pueblos<p><strong>¿Qué aprendí?</strong></p><ul><li>Los conquistadores de America fueron personas que perdieron titulo de noble en España.</li><li>America fue descubierto aproximadamente en los años 600.</li><li>Es una fábula la historia de que los españoles \"descubrieron\" America buscando otra ruta comercial ellos ya venían con la intención de conquista.</li><li>La manera de conquista fue ofreciendo curarle las heridas que ellos mismos les generaron. Ya que les ofrecian y demostraban tener más conocimientos.,</li><li>En un momento de la historia, la iglesia se queda sin dinero y empieza a vender espacios en el paraiso. Luthero se opuso a esto; creadon así sus tesis, algunas de estas fueron; que las biblias se tradujeran para que todos pudieran leerlas, además que estaba mal vender el lugar en el paraíso ya que hasta en la biblia está mal, es por eso que crea la iglesia Luthera. En esta iglesia los obispos se pueden casar y formar familia.</li><li>Debido a el movimiento Lutherano se crean otras iglesias, este es el caso de la iglesia Calvinista. En Costa Rica esta iglesia exige tener mínimo 100 millones en la cuenta para poder formar parte, ya que el fundador dice que la pobreza es la manera en la que Dios castiga los pecados entonces si se está bien economicamente ya está salvado.</li><li>15 de setiembre de 1810; en esta fecha se obtiene independencia económica de parte de la corona española, es considerada la primer fecha de independencia.,</li><li>15 de Setiembre de 1821; independencia geográfica y política de la corona española, esta es la segunda fecha de independencia.</li><li>Cartago se estableció como la primer ciudad colonial por ser apta para el cultivo.</li><li>Los pueblos actuales tienen la colonización como modelo para distribuir y posicionar sus edificaciones.</li><li>En nuestro país aún existen grupos indígenas porque se alejaron del centro.</li><li>En los paises europeos casi no hay lugares aptos para cultivar, es por esto que vinieron a America con intenciones de apoderarse de lugares para sus cultivos, ya que es la mayor riqueza que existe en este continente.</li></section>"
    },
    {
        "WeekID": "3",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 3</h2><div class='content'><h3 class='dateWeek'>28-09-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>El profesor hablo y expuso sobre la construcción de la identidad costarricense</p><p><strong>¿Qué aprendí?</strong></p><p>El principal aprendizaje de esta semana fueron algunos factores y acontecimientos que hicieron que la identidad del costarricense sea a como la conocemos en la actualidad</p></div></div></section>"
    },
    {
        "WeekID": "4",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 4</h2><div class='content'><h3 class='dateWeek'>05-10-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Se realizó la primer exposición sobre los personajes que forja la identidad</p><p><strong>¿Qué aprendí?</strong></p><ul><li class='subtitle-description'>Cesar Melendez</li><li>Aporto a la cultura en el país</li><li class='subtitle-description'>Fidel Gamboa (Malpais)</li><li>Este personaje también aportó a la cultura del país, en la música especialmente, esto porque con su grupo es el mayor exponente de música folclórica para el país</li><li class='subtitle-description'>Yokasta Valle</li><li>Es un ejemplo de que hay que aferrarse a los sueños</li><li class='subtitle-description'>Junior Oporta</li><li>Es una persona luchadora, y es muy creyente</li><li class='subtitle-description'>Mauricio Piedra</li><li>Ha creado canciones que han sonado a nivel internacional dejando a San Carlos en grande ante el mundo</li><li class='subtitle-description'>Sandra Cauffman</li><li>Es una mujer involucrada en la ciencia y tecnología, que ha sido destacada por la ONU como un ejemplo de esfuerzo para las mujeres</li><li class='subtitle-description'>Pilar Cisneros</li><li>Hizo aportes en algunas leyes del país</li><li class='subtitle-description'>Franklin Chag</li><li>Fue el primer tico en la Nasa, sin embargo, renunció a la nacionalidad costarricense y se quedó solo con la de Estados Unidos por politicas de la Nasa, años después Costa Rica le otorga una Nacionalidad de Honor</li></ul></div></div></section>"
    },
    {
        "WeekID": "5",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 5</h2><div class='content'><h3 class='dateWeek'>12-10-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Se realizó una clase asíncrona, dónde solo se nos asignó una evaluación; de realizar la lectura llamada LA CONSTRUCCIÓN DE LA IDENTIDAD COSTARRICENSE EN LOS TEXTOS PLÁSTICOS Y LITERARIOS DE AMIGHETTI. Para luego realizar un cuadro de doble entrada y una infografía basados en esta lectura</p><p><strong>¿Qué aprendí?</strong></p><ul><li>Realizando esta evaluación aprendí sobre lo penetrate que es considerado el ser costarricense</li><li>Además algunas diferencias y sucesos que pasaron por el arte en esos años</li><li>También aprendí un poco sobre otros acontecimientos que cambiaron drásticamente el país; por ejemplo, el cambio de siglo.</li><li>Por último, en esta lectura se relata la manera en la que se configura el modo de ser costarricense, y todo los factores que influyen para que esto se logre de esa manera</li></ul></div></div></section>"
    },
    {
        "WeekID": "6",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 6</h2><div class='content'><h3 class='dateWeek'>05-10-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Se realizó la última exposición sobre los personajes que forja la identidad</p><p><strong>¿Qué aprendí?</strong></p><ul><li class='subtitle-description'>Natalia Carvajal</li><li>Es una modelo, reina de belleza, actriz, presentadora y publicista, reconocida en Costa Rica por participar en la televisión nacional</li><li class='subtitle-description'>Carlos Gúzman</li><li>Es un músico, compositor, productor, arreglista y director musical costarricense</li><li class='subtitle-description'>Walter Campos</li><li>es un comunicador costarricense con una maestría en comunicación y un bachillerato en publicidad. Ha trabajado en diversos roles, incluyendo la producción y conducción de programas de televisión</li><li class='subtitle-description'>Clodomiro Picado</li><li>Fue un distinguido científico costarricense. Desempeñó un papel central en el desarrollo inicial de varias ramas de la ciencia en Costa Rica</li><li class='subtitle-description'>Noelia Bermudez</li><li>Ella es una futbolista costarricense. Juega como portera.</li><li class='subtitle-description'>Sergio Iván Guillén Ramírez (SNK)</li><li>Mejor conocido en el mundo del rap como SNK, es un talentoso rapero costarricense</li><li>Con una destacada carrera en la escena del freestyle y el rap, SNK ha ganado reconocimiento tanto a nivel nacional como internacional.</li><li class='subtitle-description'>Lorenzo Salazar Morales (Lencho Salazar)</li><li>Es un músico y folclorista costarricense</li><li>Inició su carrera musical con tan solo 5 años de edad</li><li class='subtitle-description'>Hernán Jiménez García</li><li>Es un director cinematográfico, actor, comediante y escritor costarricense</li><li>Su prolífico catálogo como director incluye películas muy aclamadas por la crítica y el público costarricense</li><li>También ha escrito y realizado cinco monólogos</li></ul></div></div></section>"
    },
    {
        "WeekID": "7",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 7</h2><div class='content'><h3 class='dateWeek'>26-10-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>En esta semana se asistió a una actividad cultural, en este caso fue una puesta en escena</p><p><strong>¿Qué aprendí?</strong></p><p>Esta puesta en escena dejó en evidencia cómo los cuentos de hadas se han encargado de vendernos humo con las historias que relatan ya que no siempre las mujeres deben esperar, ni esperar hasta que llegue el principe azul, que no siempre es como lo pintan en estas historias. Además de otros aspectos que de igual forma desde niños nos han enseñado mediante estos dibujos animados que son sencillas, o que son de ensueño, cuando la realidad es muy distinta</p></div></div></section>"
    },
    {
        "WeekID": "8",
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 8</h2><div class='content'><h3 class='dateWeek'>02-11-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Se habla sobre la Historiografía de Costa Rica</p><p><strong>¿Qué aprendí?</strong></p><ul><li>Exposición sobre <span class='bold-word'>Keylor Gutierréz</span>; profesor de música y folcrórista.</li><li>El profe explica sobre la <span class='bold-word'>Historiografía de Costa Rica 1821 - 1870</span></li><li>La narrativa de nuestro país no ha sido exacta, por ejemplo el billete de 5 colones que circuló ensu momento, ya que el paisaje está erroneo porque fue hecho por un artista francés.</li><li>15 de setiembre de 1821: Se proclama de Independencia de la Capitanía General de Guatemala.</li><li>Cuando los lideres de la corona española recibió la oferta de que el centro del continente se queríaindependizar, ya que tenían conflictos en el norte y sur del país, además de que era un gasto parala corona.</li><li>16 de setiembre de 1821: Se redacta el acta coercitiva que se envía al resto de las municipalidades.</li><li>Reacción de Costa Rica: Ante el recibimiento del acta de independencia, junto al Acta de losNublados.</li><li>En Cartago se encontraba el poder político apoyaba la anexión a México pero separado de Guatemala.</li><li>San José proclamaba una independencia total.</li><li>Anexión a México: Se proclama a inicio de Enero del año 1822.</li><li>El imperio Mexicano cae en 1823 e Iturbide es fusilado al año siguiente.</li><li>Formación y consolidación del Estado Costarricense (1821 - 1890)</li><li>Costa Rica era la porvincia de menor desarrollo económico y político, dependía de las directricesdirectas de la Capitanía General.</li><li>Sus lazos comerciales eran con Panamá y Nicaragua, con productos derivados de la ganadería y eltabaco.</li><li>La población era de unos 50 mil habitantes, concentrados mayoritariamente en el valle central yexistía un alto nivel de analfabetismo y resaltaba la pobreza entre los pueblos.</li><li>La composición de los ciudadanos no era como costarricenses, si no como heredianos, alajuelense,cartagos o josefinos.</li><li>Los pobres estaban divididos en los cabildos y no había una centralización del mismo.</li><li>El primer gobierno de Costa Rica se formó en enero de 1822, compuesto por siete miembrospropietarios y tres suplentes, el mismo se encontró instalado en Cartago.</li><li>El 5 de abril de 1823 se lleva a acabo la denominada guerra de Ochomogo que da el triunfo a losRepublicanos.</li><li class='subtitle-description'>La Republica Federal Centroamericana (1823 - 1838)</li><li>Costa Rica se incorporó a partir de 1824.</li><li>El 1 de julio de 1823 en la Asamblea General Constituyente se decreta la independencia absoluta deEspaña, México o cualquier otra potencia y se acordó la formación de una nación soberana.</li><li class='subtitle-description'><span class='bold-word'>Fundación de la República</span></li><li>Último jefe de Estado y primer Presidente: José María Castro Madriz.</li><li>El 31 de agosto de 1848 este señor declara la fundación de la Republica.</li><li>Juan Rafael Mora Porras asume la presidencia desde 1849 - 1859.</li><li class='subtitle-description'><span class='bold-word'>Escritores destacados de CR</span></li><li>La literatura costarricense ha buscado establecer una identidad litararia y cultural propia, alejandose de las influencias europeas.</li><li class='subtitle-description'><span class='bold-word'>Carlos Gagini</span></li><li>Apesar de no ser de familia adinerada podía describir a la clase politica sin ninguna repercusión.</li><li>Se enfoncó en novelas y cuentos.</li><li class='subtitle-description'><span class='bold-word'>Aquileo Echeverria</span></li><li>Poeta de exquisita sensibilidad artistica, es una de las figuras más importantes de las historia literaria de este país, al punto que se le considera el poeta nacional de Costa Rica.</li><li class='subtitle-description'><span class='bold-word'>Joaquín García Monge</span></li><li>Este hombre dedicó gran parte de sus últimos años a la militancia politica.</li><li class='subtitle-description'><span class='bold-word'>Francisco Amighetti</span></li><li>Es reconocido por ser un multifacético muralista, pintor, escritor y principalmente, uno de los xilógrafos latinoamericanos más sobresalientes del siglo XX</li><li class='subtitle-description'><span class='bold-word'>Yolanda Oreamuno</span></li><li>Joaquín García Monge se convirtió en su maestro, editor y amigo.</li><li>Fue exiliada durante la dictadura de Federico Tinoco (1917 - 1919)</li><li class='subtitle-description'><span class='bold-word'>Carmen Naranjo Coto</span></li><li>Fue una mujer adelantada y transgresora de acuerdo a la época.</li><li class='subtitle-description'><span class='bold-word'>Quince Duncan</span></li><li>Es un escritor, autor y coautor de más de 50 libros</li><li>Es el primer escritor costarricense afrocaribeño en idioma español</li><li>Su trabajo se refiere, por lo general, a la población afrocaribeña</li><li class='subtitle-description'><span class='bold-word'>Alberto Cañas Escalante</span></li><li>Fue un periodista muy relevante, además escritor, político y profesor universitario</li><li class='subtitle-description'><span class='bold-word'>Lara Rios</span></li><li>Los géneros que desarrolla se encuentran cuento, poesía y novela</li></ul></div></div></section>"
    },
    {
        "WeekID": "9", 
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 9</h2><div class='content'><h3 class='dateWeek'>09-11-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Se hicieron las exposiciones sobre las generaciones literarias en Costa Rica</p><p><strong>¿Qué aprendí?</strong></p><ul><li>Algunas de las generaciones de las que se expuso fueron; la Generación del Repertorio Americano o Vanguardia, Generación del 40 y Generación Urbana</li><li class='subtitle-description'>Generación del Repertorio Americano o Vanguardia</li><li>Denominada de esta forma por encontrarse ligada a la revista Repertorio Americano de Joaquín García Monge</li><li>Durante este período se da la crisis del régimen oligárquico liberal</li><li class='subtitle-description'>Generación del 40</li><li>Fue una época de cuestionamientos y renovaciones, de importantes reformas sociales en Costa Rica (como las Garantías Sociales) y de un nuevo concepto de Estado.</li><li class='subtitle-description'>Generación Urbana</li><li>Durante este tiempo se concreta en Costa Rica un proceso de modernización e industrialización.</li></ul></div></div></section>"
    },
    {
        "WeekID": "10", 
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 10</h2><div class='content'><h3 class='dateWeek'>16-11-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Clase asíncrona, preparación puesta en escena</p><p><strong>¿Qué aprendí?</strong></p><p>En esta semana la clase fue asíncrona para ensayar y afinar los últimos detalles de las puestas en escena. Los grupos se reunieron dónde mejor les convenía para realizar los cambios y ensayos respectivos</p></div></div></section>"
    },
    {
        "WeekID": "11", 
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 11</h2><div class='content'><h3 class='dateWeek'>16-11-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Se realizaron las Puestas en Escena de ambos grupos</p><p><strong>¿Qué aprendí?</strong></p><p>Este día, la clase se dividió en 2 secciones antes y después del receso, para que los grupos pudieran montar la escenografía necesaria. El mayor aprendizaje de este día fue que no es necesario ser un actor profesional para hacer un buen desempeño, solo es asunto de actitud y esfuerzo; además, de que No Existen Papeles Pequeños</p></div></div></section>"
    },
    {
        "WeekID": "12", 
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 12</h2><div class='content'><h3 class='dateWeek'>30-11-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Se hicieron los stand y las respectivas presentaciones sobre las fiestas populares en Costa Rica</p><p><strong>¿Qué aprendí?</strong></p><ul><li>Se realizaron exposiciones acerca de varias fiestas populares; algunas de ellas fueron, Las Fiestas de Santa Cruz, La Semana Santa, Los Carnavales de Limón y Navidad</li><li>La celebración que se desarrolla en Limón es muy caracteristicas por usar atuendos exquisitos, además que no se pueden reutilizar</li><li>Por otro lado, la Semaa Santa es muy de costumbres, más que todo en los católicos, ya que cada día, y acción que realizan tiene un significado y una manera estricta de realizarse</li><li>Finalmente, aprendí que el color rojo de la navidad fue tomado como parte de, debido a una campaña publicitaria de Coca Cola</li></ul></div></div></section>"
    },
    {
        "WeekID": "13", 
        "html": "<section class='semana' onclick='openAccordion(event)'><h2 class='titleWeek'>Clase 13</h2><div class='content'><h3 class='dateWeek'>7-12-2023</h3><div class='registro-clase'><p><strong>¿Qué se hizo?</strong></p><p>Está clase fue una clase asíncrona en la cual solo debiamos hacer una autoevaluación y la entrega de la bitácora</p><p><strong>¿Qué aprendí?</strong></p><p>Lo que aprendí en esta semana fue a autoevaluarme, y que hay que ser conciente con estas decisiones, ya que a veces no reflexionamos en cómo es nuestro desempeño en algún curso</p></div></div></section>"
    }
]